def start_the_bot():

    text = '''
    RANDOMS_MEDIA
    يساعد صانعين المحتوى بمختلف الطرق من بينها الهاشتاجات الذي يمكن ان يستعملونها بالفيديوهات الخاصه بهم مواقع ذكاء اصطناعي يمكن ان تسرع من اليه انتاجهم للفيديو مواقع جدوله المنشورات التي يمكن ان تساعد صانع المحتوى بان ينشر الفيديو الخاص به في جميع منصات التواصل الاجتماعي في نفس اللحظه والهوكس التي تساعد صنع المحتوى على جذب المشاهد ليحضر الفيديو بشكل كامل
    '''

    return text

def the_user_helper():
    text = '''
    معرفه عدد المستخدمين \n /users_num
    معرفه id المستخدمين \n /users_id
    معرفه معلومات حول مستخدم واحد فقط \n /user
    ارسال نص لكل مستخدمين البوت \n /user_bc
    ارسال ملف يحتوي على الid الخاص بكل المستخدمين \n /users_file
    '''

    return text

def suggestions ():

    suggestions = '''
    من خلال البريد الإلكتروني المرفق أدناه ، 
    يمكنك تدوين أي ملاحظات حول هذا البوت 
    واقتراحات 
    randoms.requests@gmail.com

    او عبر صفحاتي عبر مواقع التواصل الاجتماعي 
    '''

    return suggestions

def the_bots():

    the_bots_ = '''
    اعمال RANDOMS
    '''

    return the_bots_

def about_the_bot():
    text = '''
    RANDOMS_MEDIA
    الاصدار: 1.0
    يسرع لك اليه انتاج الفيديو بمختلف الطرق والادوات الفعاله والمجربه
    لتطوير بوتك الخاص يمكنك التواصل معنا
    عبر:
    '''

    return text

